<!DOCTYPE html>
<html>

<head>
    <meta charset="utf-8">
    <title>Личный сайт студента GeekBrains</title>
    <link rel="stylesheet" href="../style.css" media="screen">
</head>

<body>
    <header>
        <nav>
            <nav>
                <a href="../index.php">Главная</a>
                <a href="../games/games.php">Игры</a>
                <a href="../programs/programs.php">Программы</a>
                <a href="scores.php">Моя учёба</a>
                <a class="selected" href="about.php">Обо мне</a>
            </nav>
        </nav>
    </header>
    <h1 id="#top">Личный сайт студента GeekBrains.</h1>
    <h1>Студент факультета веб-разработки. 2020 год.</h1>
    <main>
        <img src="../img/photo.jpg" alt="Фотография">
        <div>
            <p>Добрый день. Меня зовут <i><b>Казанин Евгений Алексеевич</b></i>. Мне 31 год, холост. Получил техническое высшее образование, но с программированием никак до этого связан не был. Работал не по специальности и во общем-то достиг на предыдущей работе своего потолка. Уже давненько задумывался что пора что-то менять в своей жизни, и большие февральские скидки на сайте GeekBrains окончательно убедили меня, что лучшего момента для смены курса моей жизни мне не найти.</p><br>

            <p>Однако это не было совсем уж спонтанным решением. Я был знаком с сайтом GeekBrains еще с 2016 года, когда узнал о нём из рекламы на YouTube канале Ridddl'а. Однако я тогда только зарегистрировался в поддержку канала, и даже, когда мне позвонила девушка с GeekBrains с вопросом что я хочу изучать, так как зарегистрировался у них, я честно ответил, что пришел по рекламной ссылке, текущей работой доволен, и за прошедшие три года с получения высшего образования соскучиться по учебе не успел :) На этом наш диалог и завершился тогда.</p><br>

            <p>Я время от времени видел еще их рекламу то у Риддла, то ещё у кого, иногда даже возникали мысли поучиться, тем более, что у меня бывали моменты, когда меня то в переводы компьютерных игр заносило, то модов к ним, то даже что-то пробовал создавать ("Привет, Морровинд/Обливион/Скайрим!"), неудачно правда в основном (понятное дело, что я не учитываю заточку чужого мода под себя, это не мод, а так, баловство), но лень и удовлетворенность текущим состоянием дел висело тяжелыми гирями на желании чем-то серьезно заняться.</p><br>

            <p>Конечно, не сказать, чтобы я вообще не занимался саморазвитием в то время. Например, так как я с детства больше <a href="https://wikigrowth.ru/psyhologiya/introvert/" target="_blank">интроверт</a>, чем экстраверт, то мои навыки коммуникации с незнакомыми людьми были на достаточно низком уровне. Да, это мне не мешало в работе инженера, работающего в закрытом помещении, с только ещё одним напарником, но всё же.</p><br>

            <p>Не говоря уж знакомиться и разговаривать с незнакомыми девушками, тем более с красивыми, было тем еще квестом плюс к обычным нервам в такой ситуации. Так что в 2017 году записался и прошел базовый трехнедельный курс <a href="https://www.rmes.ru/trenings/" target="_blank">РМЭС</a>. Честно говоря, Казановой так и не стал, в отличие от некоторых сокурсников, но во всяком случае главное то, ради чего я на него пошел, я получил, научился спокойно знакомиться и разговаривать с незнакомыми людьми (и с девушками тоже ;)), стал себя более увереннее чувствовать в окружении незнакомых людей, непривычных ситуациях и в "тусовке".</p><br>

            <p>Да, я всё еще предпочитаю книги и компьютер "живым" тусовкам, и редко хожу на концерты, но изменения на мой взгляд были положительными. Собственно в каком-то смысле именно прохождение этого курса с подвигло меня на прохождение почти сразу после него следующего курса <a href="https://centermassage.ru/programma-klassika" target="_blank">Классического массажа</a>.</p><br>

            <p>Познакомился с одной девушкой, которая как раз подумывала их пройти, и решил, что это не плохой способ продолжения знакомства, тем более, что тема была мне интересна. С девушкой, в дальнейшем, ничего не получилось, а вот сертификат доказывающий, что в январе 2018го я сдал теоретические и практические зачеты за 60 часовой курс и могу быть допущен до работы салонах красоты и прочих учреждениях подобного профиля у меня есть. Правда, конечно, у меня совершенно нет практики... С другой стороны я никогда и не планировал массажистом именно работать, а как закрепление практики предыдущего курса прошло замечательно ;) Да, и это <i>было</i> интересно и это самое важное.</p><br>

            <p>Но вернемся ближе к этому сайту, и почему я вообще оказался на курсе программирования? Несколько причин. Первая: мой младший брат больше пяти лет назад начал самостоятельно изучать программирование, ну плюс уже три года как учится на одни пятерки в институте именно на программиста (факультет, конечно называется по другому, но, каюсь, забыл как), что привело к тому, что "волшебная" профессия, которая вообще почти магия для избранных, только без приглашения с помощью совы, сама, так сказать, пришла в мой дом. Трудно существовать в одной плоскости с близкими людьми, и вообще не иметь понятия, чем они занимаются и интересуются, поэтому не большие проблески этого аккуратно манящего мира я видел. Не очень внимательно, конечно, из-за своей жизни и своих книг, но всё же.</p><br>

            <p>А вот вторая причина была более банальна. Возможность получения интересной и высокооплачиваемой (конечно для специалистов высокого уровня) работы. Надо признать, что в детстве/юности я был пофигистом, со всеми вытекающими отсюда плюсами и минусами. Про плюсы я думаю и так многие знают, а вот в минусы попало то, что никаких планов в школе о том, чем буду заниматься после неё у меня не было от слова вообще. Мой будущий путь можно описать следующим массивом:</p><br>

            <ol>
                <li>Окончил школу.</li>
                <li>Вроде надо в институт/армию.</li>
                <li>Мне пофиг.</li>
                <li>Мама хочет, чтобы я пошел в институт.</li>
                <li>Сдал экзамены в два института, один который оканчивала мама, плюс один, который ближайший к дому, к тому же имел связь с моей школой.</li>
                <li>Пофигистически жду результатов экзаменов,мне в армию или в институт? (Один, из второго забрал документы, так как сдал всего на пару балов выше прошлогоднего минимума на право бесплатного обучения, а денег не было).</li>
                <li>В том же душевном состоянии узнал о поступлении в институт на бесплатное дневное отделение, и тот факт, что отправили меня на совершенно другой факультет, чем куда я подавал документы. Отнесся к этому философски, какая разница какой факультет, главное что здание одно, и друг на тот же факультет попал (и главное, что там еще двух друзей нашел, привет, если читаете: <b>Макс, Леха, Макс!</b></li>
                <li>Отучился кое-как на автопилоте первые 3 курса, после чего пофигизм как-то почти улетучился, осознал что учится всё-таки надо серьёзнее и окончил сначала бакалавриат, а потом и магистратуру уже лучше. Хотя, конечно, диплом о магистратуре у меня выглядит намного лучше чем диплом бакалавра.</li>
                <li>Сходил в армию, полностью добровольно, чем и горжусь.</li>
                <li>Пошел работать... совершенно не по специальности. И сейчас, спустя почти 6 лет после этого решения оказался в положении: возвращаться нельзя, да и не хочется, идти вперед некуда, да и не зачем, там дальше в основном менеджерски/управленческие должности, вот совершенно мне это не интересно.</li>
            </ol><br>

            <p>Конечно это невероятно упрощенная дорожная карта моей второй половины (из уже прожитой) жизни, но и это не автобиография, главное, что пускай я имею только базовое понимание о программировании и сколько оно требует вложения в него личного времени и труда, чтобы быть специалистом, а не "специалистом", я считаю, что у меня есть возможность вписаться в этот мир и получить возможность заниматься интересным делом, самосовершенствоваться, особенно, в самом начале, когда буквально видишь по своему коду, что стал чуть лучше, чем был вчера и ... зарабатывать на этом.</p><br>

            <p>Это мой первый самостоятельно созданный сайт. Он, пока еще, почти типовой, имеет в себе ошибки, не точности и огромное пространство для улучшения. Но он уже мой, и кто знает, может когда-нибудь он станет живой витриной, музеем моих достижений на этой не легкой, но интересной дороге. С уважением ко всем читателям данного текста, Евгений a.k.a. Джеф.</p><br>

            <p>Да, и отдельное спасибо IT-порталу <a href="https://geekbrains.ru/" target="_blank">GeekBrains</a>, всё таки если бы его не существовало бы, то и этого сайта тоже не было бы.<br>
                <a href="#top">Вернуться к началу страницы.</a>
            </p>
        </div>
    </main>

    <footer>
        <span>Copyright &copy; <?php echo date("Y");?> Казанин Е.А.</span>
    </footer>
</body>

</html>
