<!DOCTYPE html>
<html>

<head>
    <meta charset="utf-8">
    <title>Личный сайт студента GeekBrains</title>
    <link rel="stylesheet" href="../style.css" media="screen">
</head>

<body>
    <header>
        <nav>
            <nav> <a href="../index.php">Главная</a> <a href="../games/games.php">Игры</a> <a href="../programs/programs.php">Программы</a> <a href="scores.php">Моя учёба</a> <a class="selected" href="about.php">Обо мне</a> </nav>
        </nav>
    </header>
    <h1 id="#top">Личный сайт студента GeekBrains.</h1>
    <h1>Студент факультета <nobr>веб-разработки</nobr>. 2020 год.</h1>
    <main> <img src="../img/photo.jpg" alt="Фотография">
        <div>
            <p>Добрый день. Меня зовут <i><b>Казанин Евгений Алексеевич</b></i>. Мне 31 год, холост. Получил техническое высшее образование, но&nbsp;с&nbsp;программированием никак до&nbsp;этого связан не&nbsp;был. Работал не&nbsp;по&nbsp;специальности и&nbsp;во&nbsp;<nobr>общем-то</nobr> достиг на&nbsp;предыдущей работе своего потолка. Уже давненько задумывался что пора <nobr>что-то</nobr> менять в&nbsp;своей жизни, и&nbsp;большие февральские скидки на&nbsp;сайте GeekBrains окончательно убедили меня, что лучшего момента для смены курса моей жизни мне не&nbsp;найти.</p><br>
            <p>Однако это не&nbsp;было совсем уж&nbsp;спонтанным решением. Я&nbsp;был знаком с&nbsp;сайтом GeekBrains еще с&nbsp;2016 года, когда узнал о&nbsp;нём из&nbsp;рекламы на&nbsp;YouTube канале Ridddl&rsquo;а. Однако я&nbsp;тогда только зарегистрировался в&nbsp;поддержку канала, и&nbsp;даже, когда мне позвонила девушка с&nbsp;GeekBrains с&nbsp;вопросом что я&nbsp;хочу изучать, так как зарегистрировался у&nbsp;них, я&nbsp;честно ответил, что пришел по&nbsp;рекламной ссылке, текущей работой доволен, и&nbsp;за&nbsp;прошедшие три года с&nbsp;получения высшего образования соскучиться по&nbsp;учебе не&nbsp;успел:) На&nbsp;этом наш диалог и&nbsp;завершился тогда.</p><br>
            
            <p>Я&nbsp;время от&nbsp;времени видел еще их&nbsp;рекламу то&nbsp;у&nbsp;Риддла, то&nbsp;ещё у&nbsp;кого, иногда даже возникали мысли поучиться, тем более, что у&nbsp;меня бывали моменты, когда меня то&nbsp;в&nbsp;переводы компьютерных игр заносило, то&nbsp;модов к&nbsp;ним, то&nbsp;даже <nobr>что-то</nobr> пробовал создавать (&laquo;Привет, Морровинд/Обливион/Скайрим!&raquo;), неудачно правда в&nbsp;основном (понятное дело, что я&nbsp;не&nbsp;учитываю заточку чужого мода под себя, это не&nbsp;мод, а&nbsp;так, баловство), но&nbsp;лень и&nbsp;удовлетворенность текущим состоянием дел висело тяжелыми гирями на&nbsp;желании <nobr>чем-то</nobr> серьезно заняться.</p><br>
            
            <p>Конечно, не&nbsp;сказать, чтобы я&nbsp;вообще не&nbsp;занимался саморазвитием в&nbsp;то&nbsp;время. Например, так как я&nbsp;с&nbsp;детства больше <a href="https://wikigrowth.ru/psyhologiya/introvert/" target="_blank">интроверт</a>, чем экстраверт, то&nbsp;мои навыки коммуникации с&nbsp;незнакомыми людьми были на&nbsp;достаточно низком уровне. Да, это мне не&nbsp;мешало в&nbsp;работе инженера, работающего в&nbsp;закрытом помещении, с&nbsp;только ещё одним напарником, но&nbsp;всё&nbsp;же.</p><br>
            
            <p>Не&nbsp;говоря уж&nbsp;знакомиться и&nbsp;разговаривать с&nbsp;незнакомыми девушками, тем более с&nbsp;красивыми, было тем еще квестом плюс к&nbsp;обычным нервам в&nbsp;такой ситуации. Так что в&nbsp;2017 году записался и&nbsp;прошел базовый трехнедельный курс <a href="https://www.rmes.ru/trenings/" target="_blank">РМЭС</a>. Честно говоря, Казановой так и&nbsp;не&nbsp;стал, в&nbsp;отличие от&nbsp;некоторых сокурсников, но&nbsp;во&nbsp;всяком случае главное то, ради чего я&nbsp;на&nbsp;него пошел, я&nbsp;получил, научился спокойно знакомиться и&nbsp;разговаривать с&nbsp;незнакомыми людьми (и&nbsp;с&nbsp;девушками тоже;)), стал себя более увереннее чувствовать в&nbsp;окружении незнакомых людей, непривычных ситуациях и&nbsp;в&nbsp;&laquo;тусовке&raquo;.</p><br>
            <p>Да, я&nbsp;всё еще предпочитаю книги и&nbsp;компьютер &laquo;живым&raquo; тусовкам, и&nbsp;редко хожу на&nbsp;концерты, но&nbsp;изменения на&nbsp;мой взгляд были положительными. Собственно в&nbsp;<nobr>каком-то</nobr> смысле именно прохождение этого курса с&nbsp;подвигло меня на&nbsp;прохождение почти сразу после него следующего курса <a href="https://centermassage.ru/programma-klassika" target="_blank">Классического массажа</a>.</p><br>
            
            <p>Познакомился с&nbsp;одной девушкой, которая как раз подумывала их&nbsp;пройти, и&nbsp;решил, что это не&nbsp;плохой способ продолжения знакомства, тем более, что тема была мне интересна. С&nbsp;девушкой, в&nbsp;дальнейшем, ничего не&nbsp;получилось, а&nbsp;вот сертификат доказывающий, что в&nbsp;январе 2018го я&nbsp;сдал теоретические и&nbsp;практические зачеты за&nbsp;60 часовой курс и&nbsp;могу быть допущен до&nbsp;работы салонах красоты и&nbsp;прочих учреждениях подобного профиля у&nbsp;меня есть. Правда, конечно, у&nbsp;меня совершенно нет практики&hellip; С&nbsp;другой стороны я&nbsp;никогда и&nbsp;не&nbsp;планировал массажистом именно работать, а&nbsp;как закрепление практики предыдущего курса прошло замечательно;) Да, и&nbsp;это <i>было</i> интересно и&nbsp;это самое важное.</p><br>
            
            <p>Но&nbsp;вернемся ближе к&nbsp;этому сайту, и&nbsp;почему я&nbsp;вообще оказался на&nbsp;курсе программирования? Несколько причин. Первая: мой младший брат больше пяти лет назад начал самостоятельно изучать программирование, ну&nbsp;плюс уже три года как учится на&nbsp;одни пятерки в&nbsp;институте именно на&nbsp;программиста (факультет, конечно называется по&nbsp;другому, но, каюсь, забыл как), что привело к&nbsp;тому, что &laquo;волшебная&raquo; профессия, которая вообще почти магия для избранных, только без приглашения с&nbsp;помощью совы, сама, так сказать, пришла в&nbsp;мой дом. Трудно существовать в&nbsp;одной плоскости с&nbsp;близкими людьми, и&nbsp;вообще не&nbsp;иметь понятия, чем они занимаются и&nbsp;интересуются, поэтому не&nbsp;большие проблески этого аккуратно манящего мира я&nbsp;видел. Не&nbsp;очень внимательно, конечно, <nobr>из-за</nobr> своей жизни и&nbsp;своих книг, но&nbsp;всё&nbsp;же.</p><br>
            
            <p>А&nbsp;вот вторая причина была более банальна. Возможность получения интересной и&nbsp;высокооплачиваемой (конечно для специалистов высокого уровня) работы. Надо признать, что в&nbsp;детстве/юности я&nbsp;был пофигистом, со&nbsp;всеми вытекающими отсюда плюсами и&nbsp;минусами. Про плюсы я&nbsp;думаю и&nbsp;так многие знают, а&nbsp;вот в&nbsp;минусы попало то, что никаких планов в&nbsp;школе о&nbsp;том, чем буду заниматься после неё у&nbsp;меня не&nbsp;было от&nbsp;слова вообще. Мой будущий путь можно описать следующим массивом:</p><br>
            <ol>
                <li>Окончил школу.</li>
                
                <li>Вроде надо в&nbsp;институт/армию.</li>
                
                <li>Мне пофиг.</li>
                
                <li>Мама хочет, чтобы я&nbsp;пошел в&nbsp;институт.</li>
                
                <li>Сдал экзамены в&nbsp;два института, один который оканчивала мама, плюс один, который ближайший к&nbsp;дому, к&nbsp;тому&nbsp;же имел связь с&nbsp;моей школой.</li>
                
                <li>Пофигистически жду результатов экзаменов, мне в&nbsp;армию или в&nbsp;институт? (Один, из&nbsp;второго забрал документы, так как сдал всего на&nbsp;пару балов выше прошлогоднего минимума на&nbsp;право бесплатного обучения, а&nbsp;денег не&nbsp;было).</li>
                
                <li>В&nbsp;том&nbsp;же душевном состоянии узнал о&nbsp;поступлении в&nbsp;институт на&nbsp;бесплатное дневное отделение, и&nbsp;тот факт, что отправили меня на&nbsp;совершенно другой факультет, чем куда я&nbsp;подавал документы. Отнесся к&nbsp;этому философски, какая разница какой факультет, главное что здание одно, и&nbsp;друг на&nbsp;тот&nbsp;же факультет попал (и&nbsp;главное, что там еще двух друзей нашел, привет, если читаете: <b>Макс, Леха, Макс!</b></li>
                
                <li>Отучился <nobr>кое-как</nobr> на&nbsp;автопилоте первые 3 курса, после чего пофигизм <nobr>как-то</nobr> почти улетучился, осознал что учится <nobr>всё-таки</nobr> надо серьёзнее и&nbsp;окончил сначала бакалавриат, а&nbsp;потом и&nbsp;магистратуру уже лучше. Хотя, конечно, диплом о&nbsp;магистратуре у&nbsp;меня выглядит намного лучше чем диплом бакалавра.</li>
                <li>Сходил в&nbsp;армию, полностью добровольно, чем и&nbsp;горжусь.</li>
                
                <li>Пошел работать&hellip; совершенно не&nbsp;по&nbsp;специальности. И&nbsp;сейчас, спустя почти 6 лет после этого решения оказался в&nbsp;положении: возвращаться нельзя, да&nbsp;и&nbsp;не&nbsp;хочется, идти вперед некуда, да&nbsp;и&nbsp;не&nbsp;зачем, там дальше в&nbsp;основном менеджерски/управленческие должности, вот совершенно мне это не&nbsp;интересно.</li>
                
            </ol><br>
            
            <p>Конечно это невероятно упрощенная дорожная карта моей второй половины (из&nbsp;уже прожитой) жизни, но&nbsp;и&nbsp;это не&nbsp;автобиография, главное, что пускай я&nbsp;имею только базовое понимание о&nbsp;программировании и&nbsp;сколько оно требует вложения в&nbsp;него личного времени и&nbsp;труда, чтобы быть специалистом, а&nbsp;не&nbsp;&laquo;специалистом&raquo;, я&nbsp;считаю, что у&nbsp;меня есть возможность вписаться в&nbsp;этот мир и&nbsp;получить возможность заниматься интересным делом, самосовершенствоваться, особенно, в&nbsp;самом начале, когда буквально видишь по&nbsp;своему коду, что стал чуть лучше, чем был вчера и&hellip; зарабатывать на&nbsp;этом.</p><br>
            
            <p>Это мой первый самостоятельно созданный сайт. Он, пока еще, почти типовой, имеет в&nbsp;себе ошибки, не&nbsp;точности и&nbsp;огромное пространство для улучшения. Но&nbsp;он&nbsp;уже мой, и&nbsp;кто знает, может <nobr>когда-нибудь</nobr> он&nbsp;станет живой витриной, музеем моих достижений на&nbsp;этой не&nbsp;легкой, но&nbsp;интересной дороге. С&nbsp;уважением ко&nbsp;всем читателям данного текста, Евгений a.k.a. Джеф.</p><br>
            
            <p>Да, и&nbsp;отдельное спасибо <nobr>IT-порталу</nobr> <a href="https://geekbrains.ru/" target="_blank">GeekBrains</a>, <nobr>всё-таки</nobr> если&nbsp;бы его не&nbsp;существовало&nbsp;бы, то&nbsp;и&nbsp;этого сайта тоже не&nbsp;было&nbsp;бы.<br> <a href="#top">Вернуться к&nbsp;началу страницы.</a> </p>
        </div>
    </main>
        <footer>
        <span>Copyright &copy; <?php echo date("Y");?> Казанин Е.А.</span>
    </footer>
</body>

</html>
